GopalSaraf/Practicals/PSDL/include/proc/pic18f8621.inc
// Register: PORTF
#define PORTF PORTF
PORTF                                    equ 0F85h
// bitfield definitions
PORTF_RF0_POSN                           equ 0000h
PORTF_RF0_POSITION                       equ 0000h
PORTF_RF0_SIZE                           equ 0001h
PORTF_RF0_LENGTH                         equ 0001h
PORTF_RF0_MASK                           equ 0001h
PORTF_RF1_POSN                           equ 0001h
PORTF_RF1_POSITION                       equ 0001h
PORTF_RF1_SIZE                           equ 0001h
PORTF_RF1_LENGTH                         equ 0001h
PORTF_RF1_MASK                           equ 0002h
PORTF_RF2_POSN                           equ 0002h
PORTF_RF2_POSITION                       equ 0002h
PORTF_RF2_SIZE                           equ 0001h
PORTF_RF2_LENGTH                         equ 0001h
PORTF_RF2_MASK                           equ 0004h
PORTF_RF3_POSN                           equ 0003h
PORTF_RF3_POSITION                       equ 0003h
PORTF_RF3_SIZE                           equ 0001h
PORTF_RF3_LENGTH                         equ 0001h
PORTF_RF3_MASK                           equ 0008h
PORTF_RF4_POSN                           equ 0004h
PORTF_RF4_POSITION                       equ 0004h
PORTF_RF4_SIZE                           equ 0001h
PORTF_RF4_LENGTH                         equ 0001h
PORTF_RF4_MASK                           equ 0010h
PORTF_RF5_POSN                           equ 0005h
PORTF_RF5_POSITION                       equ 0005h
PORTF_RF5_SIZE                           equ 0001h
PORTF_RF5_LENGTH                         equ 0001h
PORTF_RF5_MASK                           equ 0020h
PORTF_RF6_POSN                           equ 0006h
PORTF_RF6_POSITION                       equ 0006h
PORTF_RF6_SIZE                           equ 0001h
PORTF_RF6_LENGTH                         equ 0001h
PORTF_RF6_MASK                           equ 0040h
PORTF_RF7_POSN                           equ 0007h
PORTF_RF7_POSITION                       equ 0007h
PORTF_RF7_SIZE                           equ 0001h
PORTF_RF7_LENGTH                         equ 0001h
PORTF_RF7_MASK                           equ 0080h
PORTF_AN5_POSN                           equ 0000h
PORTF_AN5_POSITION                       equ 0000h
PORTF_AN5_SIZE                           equ 0001h
PORTF_AN5_LENGTH                         equ 0001h
PORTF_AN5_MASK                           equ 0001h
PORTF_AN6_POSN                           equ 0001h
PORTF_AN6_POSITION                       equ 0001h
PORTF_AN6_SIZE                           equ 0001h
PORTF_AN6_LENGTH                         equ 0001h
PORTF_AN6_MASK                           equ 0002h
PORTF_AN7_POSN                           equ 0002h
PORTF_AN7_POSITION                       equ 0002h
PORTF_AN7_SIZE                           equ 0001h
PORTF_AN7_LENGTH                         equ 0001h
PORTF_AN7_MASK                           equ 0004h
PORTF_AN8_POSN                           equ 0003h
PORTF_AN8_POSITION                       equ 0003h
PORTF_AN8_SIZE                           equ 0001h
PORTF_AN8_LENGTH                         equ 0001h
PORTF_AN8_MASK                           equ 0008h
PORTF_AN9_POSN                           equ 0004h
PORTF_AN9_POSITION                       equ 0004h
PORTF_AN9_SIZE                           equ 0001h
PORTF_AN9_LENGTH                         equ 0001h
PORTF_AN9_MASK                           equ 0010h
PORTF_AN10_POSN                          equ 0005h
PORTF_AN10_POSITION                      equ 0005h
PORTF_AN10_SIZE                          equ 0001h
PORTF_AN10_LENGTH                        equ 0001h
PORTF_AN10_MASK                          equ 0020h
PORTF_AN11_POSN                          equ 0006h
PORTF_AN11_POSITION                      equ 0006h
PORTF_AN11_SIZE                          equ 0001h
PORTF_AN11_LENGTH                        equ 0001h
PORTF_AN11_MASK                          equ 0040h
PORTF_SS_POSN                            equ 0007h
PORTF_SS_POSITION                        equ 0007h
PORTF_SS_SIZE                            equ 0001h
PORTF_SS_LENGTH                          equ 0001h
PORTF_SS_MASK                            equ 0080h
PORTF_C2OUTF_POSN                        equ 0001h
PORTF_C2OUTF_POSITION                    equ 0001h
PORTF_C2OUTF_SIZE                        equ 0001h
PORTF_C2OUTF_LENGTH                      equ 0001h
PORTF_C2OUTF_MASK                        equ 0002h
PORTF_C1OUTF_POSN                        equ 0002h
PORTF_C1OUTF_POSITION                    equ 0002h
PORTF_C1OUTF_SIZE                        equ 0001h
PORTF_C1OUTF_LENGTH                      equ 0001h
PORTF_C1OUTF_MASK                        equ 0004h
PORTF_CVREFF_POSN                        equ 0005h
PORTF_CVREFF_POSITION                    equ 0005h
PORTF_CVREFF_SIZE                        equ 0001h
PORTF_CVREFF_LENGTH                      equ 0001h
PORTF_CVREFF_MASK                        equ 0020h

// Register: PORTG
#define PORTG PORTG
PORTG                                    equ 0F86h
// bitfield definitions
PORTG_RG0_POSN                           equ 0000h
PORTG_RG0_POSITION                       equ 0000h
PORTG_RG0_SIZE                           equ 0001h
PORTG_RG0_LENGTH                         equ 0001h
PORTG_RG0_MASK                           equ 0001h
PORTG_RG1_POSN                           equ 0001h
PORTG_RG1_POSITION                       equ 0001h
PORTG_RG1_SIZE                           equ 0001h
PORTG_RG1_LENGTH                         equ 0001h
PORTG_RG1_MASK                           equ 0002h
PORTG_RG2_POSN                           equ 0002h
PORTG_RG2_POSITION                       equ 0002h
PORTG_RG2_SIZE                           equ 0001h
PORTG_RG2_LENGTH                         equ 0001h
PORTG_RG2_MASK                           equ 0004h
PORTG_RG3_POSN                           equ 0003h
PORTG_RG3_POSITION                       equ 0003h
PORTG_RG3_SIZE                           equ 0001h
PORTG_RG3_LENGTH                         equ 0001h
PORTG_RG3_MASK                           equ 0008h
PORTG_RG4_POSN                           equ 0004h
PORTG_RG4_POSITION                       equ 0004h
PORTG_RG4_SIZE                           equ 0001h
PORTG_RG4_LENGTH                         equ 0001h
PORTG_RG4_MASK                           equ 0010h
PORTG_RG5_POSN                           equ 0005h
PORTG_RG5_POSITION                       equ 0005h
PORTG_RG5_SIZE                           equ 0001h
PORTG_RG5_LENGTH                         equ 0001h
PORTG_RG5_MASK                           equ 0020h
PORTG_CCP3_POSN                          equ 0000h
PORTG_CCP3_POSITION                      equ 0000h
PORTG_CCP3_SIZE                          equ 0001h
PORTG_CCP3_LENGTH                        equ 0001h
PORTG_CCP3_MASK                          equ 0001h
PORTG_TX2_POSN                           equ 0001h
PORTG_TX2_POSITION                       equ 0001h
PORTG_TX2_SIZE                           equ 0001h
PORTG_TX2_LENGTH                         equ 0001h
PORTG_TX2_MASK                           equ 0002h
PORTG_RX2_POSN                           equ 0002h
PORTG_RX2_POSITION                       equ 0002h
PORTG_RX2_SIZE                           equ 0001h
PORTG_RX2_LENGTH                         equ 0001h
PORTG_RX2_MASK                           equ 0004h
PORTG_CCP4_POSN                          equ 0003h
PORTG_CCP4_POSITION                      equ 0003h
PORTG_CCP4_SIZE                          equ 0001h
PORTG_CCP4_LENGTH                        equ 0001h
PORTG_CCP4_MASK                          equ 0008h
PORTG_CCP5_POSN                          equ 0004h
PORTG_CCP5_POSITION                      equ 0004h
PORTG_CCP5_SIZE                          equ 0001h
PORTG_CCP5_LENGTH                        equ 0001h
PORTG_CCP5_MASK                          equ 0010h
PORTG_MCLR_POSN                          equ 0005h
PORTG_MCLR_POSITION                      equ 0005h
PORTG_MCLR_SIZE                          equ 0001h
PORTG_MCLR_LENGTH                        equ 0001h
PORTG_MCLR_MASK                          equ 0020h
PORTG_P3A_POSN                           equ 0000h
PORTG_P3A_POSITION                       equ 0000h
PORTG_P3A_SIZE                           equ 0001h
PORTG_P3A_LENGTH                         equ 0001h
PORTG_P3A_MASK                           equ 0001h
PORTG_CK2_POSN                           equ 0001h
PORTG_CK2_POSITION                       equ 0001h
PORTG_CK2_SIZE                           equ 0001h
PORTG_CK2_LENGTH                         equ 0001h
PORTG_CK2_MASK                           equ 0002h
PORTG_DT2_POSN                           equ 0002h
PORTG_DT2_POSITION                       equ 0002h
PORTG_DT2_SIZE                           equ 0001h
PORTG_DT2_LENGTH                         equ 0001h
PORTG_DT2_MASK                           equ 0004h
PORTG_P3D_POSN                           equ 0003h
PORTG_P3D_POSITION                       equ 0003h
PORTG_P3D_SIZE                           equ 0001h
PORTG_P3D_LENGTH                         equ 0001h
PORTG_P3D_MASK                           equ 0008h
PORTG_P1D_POSN                           equ 0004h
PORTG_P1D_POSITION                       equ 0004h
PORTG_P1D_SIZE                           equ 0001h
PORTG_P1D_LENGTH                         equ 0001h
PORTG_P1D_MASK                           equ 0010h
PORTG_VPP_POSN                           equ 0005h
PORTG_VPP_POSITION                       equ 0005h
PORTG_VPP_SIZE                           equ 0001h
PORTG_VPP_LENGTH                         equ 0001h
PORTG_VPP_MASK                           equ 0020h
PORTG_C3OUTG_POSN                        equ 0001h
PORTG_C3OUTG_POSITION                    equ 0001h
PORTG_C3OUTG_SIZE                        equ 0001h
PORTG_C3OUTG_LENGTH                      equ 0001h
PORTG_C3OUTG_MASK                        equ 0002h
PORTG_RJPU_POSN                          equ 0005h
PORTG_RJPU_POSITION                      equ 0005h
PORTG_RJPU_SIZE                          equ 0001h
PORTG_RJPU_LENGTH                        equ 0001h
PORTG_RJPU_MASK                          equ 0020h

// Register: PORTH
#define PORTH PORTH
PORTH                                    equ 0F87h
// bitfield definitions
PORTH_RH0_POSN                           equ 0000h
PORTH_RH0_POSITION                       equ 0000h
PORTH_RH0_SIZE                           equ 0001h
PORTH_RH0_LENGTH                         equ 0001h
PORTH_RH0_MASK                           equ 0001h
PORTH_RH1_POSN                           equ 0001h
PORTH_RH1_POSITION                       equ 0001h
PORTH_RH1_SIZE                           equ 0001h
PORTH_RH1_LENGTH                         equ 0001h
PORTH_RH1_MASK                           equ 0002h
PORTH_RH2_POSN                           equ 0002h
PORTH_RH2_POSITION                       equ 0002h
PORTH_RH2_SIZE                           equ 0001h
PORTH_RH2_LENGTH                         equ 0001h
PORTH_RH2_MASK                           equ 0004h
PORTH_RH3_POSN                           equ 0003h
PORTH_RH3_POSITION                       equ 0003h
PORTH_RH3_SIZE                           equ 0001h
PORTH_RH3_LENGTH                         equ 0001h
PORTH_RH3_MASK                           equ 0008h
PORTH_RH4_POSN                           equ 0004h
PORTH_RH4_POSITION                       equ 0004h
PORTH_RH4_SIZE                           equ 0001h
PORTH_RH4_LENGTH                         equ 0001h
PORTH_RH4_MASK                           equ 0010h
PORTH_RH5_POSN                           equ 0005h
PORTH_RH5_POSITION                       equ 0005h
PORTH_RH5_SIZE                           equ 0001h
PORTH_RH5_LENGTH                         equ 0001h
PORTH_RH5_MASK                           equ 0020h
PORTH_RH6_POSN                           equ 0006h
PORTH_RH6_POSITION                       equ 0006h
PORTH_RH6_SIZE                           equ 0001h
PORTH_RH6_LENGTH                         equ 0001h
PORTH_RH6_MASK                           equ 0040h
PORTH_RH7_POSN                           equ 0007h
PORTH_RH7_POSITION                       equ 0007h
PORTH_RH7_SIZE                           equ 0001h
PORTH_RH7_LENGTH                         equ 0001h
PORTH_RH7_MASK                           equ 0080h
PORTH_AD16_POSN                          equ 0000h
PORTH_AD16_POSITION                      equ 0000h
PORTH_AD16_SIZE                          equ 0001h
PORTH_AD16_LENGTH                        equ 0001h
PORTH_AD16_MASK                          equ 0001h
PORTH_AD17_POSN                          equ 0001h
PORTH_AD17_POSITION                      equ 0001h
PORTH_AD17_SIZE                          equ 0001h
PORTH_AD17_LENGTH                        equ 0001h
PORTH_AD17_MASK                          equ 0002h
PORTH_AD18_POSN                          equ 0002h
PORTH_AD18_POSITION                      equ 0002h
PORTH_AD18_SIZE                          equ 0001h
PORTH_AD18_LENGTH                        equ 0001h
PORTH_AD18_MASK                          equ 0004h
PORTH_AD19_POSN                          equ 0003h
PORTH_AD19_POSITION                      equ 0003h
PORTH_AD19_SIZE                          equ 0001h
PORTH_AD19_LENGTH                        equ 0001h
PORTH_AD19_MASK                          equ 0008h
PORTH_AN12_POSN                          equ 0004h
PORTH_AN12_POSITION                      equ 0004h
PORTH_AN12_SIZE                          equ 0001h
PORTH_AN12_LENGTH                        equ 0001h
PORTH_AN12_MASK                          equ 0010h
PORTH_AN13_POSN                          equ 0005h
PORTH_AN13_POSITION                      equ 0005h
PORTH_AN13_SIZE                          equ 0001h
PORTH_AN13_LENGTH                        equ 0001h
PORTH_AN13_MASK                          equ 0020h
PORTH_AN14_POSN                          equ 0006h
PORTH_AN14_POSITION                      equ 0006h
PORTH_AN14_SIZE                          equ 0001h
PORTH_AN14_LENGTH                        equ 0001h
PORTH_AN14_MASK                          equ 0040h
PORTH_AN15_POSN                          equ 0007h
PORTH_AN15_POSITION                      equ 0007h
PORTH_AN15_SIZE                          equ 0001h
PORTH_AN15_LENGTH                        equ 0001h
PORTH_AN15_MASK                          equ 0080h
PORTH_CCP9_POSN                          equ 0004h
PORTH_CCP9_POSITION                      equ 0004h
PORTH_CCP9_SIZE                          equ 0001h
PORTH_CCP9_LENGTH                        equ 0001h
PORTH_CCP9_MASK                          equ 0010h
PORTH_CCP8_POSN                          equ 0005h
PORTH_CCP8_POSITION                      equ 0005h
PORTH_CCP8_SIZE                          equ 0001h
PORTH_CCP8_LENGTH                        equ 0001h
PORTH_CCP8_MASK                          equ 0020h
PORTH_CCP7_POSN                          equ 0006h
PORTH_CCP7_POSITION                      equ 0006h
PORTH_CCP7_SIZE                          equ 0001h
PORTH_CCP7_LENGTH                        equ 0001h
PORTH_CCP7_MASK                          equ 0040h
PORTH_CCP6_POSN                          equ 0007h
PORTH_CCP6_POSITION                      equ 0007h
PORTH_CCP6_SIZE                          equ 0001h
PORTH_CCP6_LENGTH                        equ 0001h
PORTH_CCP6_MASK                          equ 0080h
PORTH_PC3_POSN                           equ 0004h
PORTH_PC3_POSITION                       equ 0004h
PORTH_PC3_SIZE                           equ 0001h
PORTH_PC3_LENGTH                         equ 0001h
PORTH_PC3_MASK                           equ 0010h
PORTH_PB3_POSN                           equ 0005h
PORTH_PB3_POSITION                       equ 0005h
PORTH_PB3_SIZE                           equ 0001h
PORTH_PB3_LENGTH                         equ 0001h
PORTH_PB3_MASK                           equ 0020h
PORTH_PC1_POSN                           equ 0006h
PORTH_PC1_POSITION                       equ 0006h
PORTH_PC1_SIZE                           equ 0001h
PORTH_PC1_LENGTH                         equ 0001h
PORTH_PC1_MASK                           equ 0040h
PORTH_PB1_POSN                           equ 0007h
PORTH_PB1_POSITION                       equ 0007h
PORTH_PB1_SIZE                           equ 0001h
PORTH_PB1_LENGTH                         equ 0001h
PORTH_PB1_MASK                           equ 0080h

// Register: PORTJ
#define PORTJ PORTJ
PORTJ                                    equ 0F88h
// bitfield definitions
PORTJ_RJ0_POSN                           equ 0000h
PORTJ_RJ0_POSITION                       equ 0000h
PORTJ_RJ0_SIZE                           equ 0001h
PORTJ_RJ0_LENGTH                         equ 0001h
PORTJ_RJ0_MASK                           equ 0001h
PORTJ_RJ1_POSN                           equ 0001h
PORTJ_RJ1_POSITION                       equ 0001h
PORTJ_RJ1_SIZE                           equ 0001h
PORTJ_RJ1_LENGTH                         equ 0001h
PORTJ_RJ1_MASK                           equ 0002h
PORTJ_RJ2_POSN                           equ 0002h
PORTJ_RJ2_POSITION                       equ 0002h
PORTJ_RJ2_SIZE                           equ 0001h
PORTJ_RJ2_LENGTH                         equ 0001h
PORTJ_RJ2_MASK                           equ 0004h
PORTJ_RJ3_POSN                           equ 0003h
PORTJ_RJ3_POSITION                       equ 0003h
PORTJ_RJ3_SIZE                           equ 0001h
PORTJ_RJ3_LENGTH                         equ 0001h
PORTJ_RJ3_MASK                           equ 0008h
PORTJ_RJ4_POSN                           equ 0004h
PORTJ_RJ4_POSITION                       equ 0004h
PORTJ_RJ4_SIZE                           equ 0001h
PORTJ_RJ4_LENGTH                         equ 0001h
PORTJ_RJ4_MASK                           equ 0010h
PORTJ_RJ5_POSN                           equ 0005h
PORTJ_RJ5_POSITION                       equ 0005h
PORTJ_RJ5_SIZE                           equ 0001h
PORTJ_RJ5_LENGTH                         equ 0001h
PORTJ_RJ5_MASK                           equ 0020h
PORTJ_RJ6_POSN                           equ 0006h
PORTJ_RJ6_POSITION                       equ 0006h
PORTJ_RJ6_SIZE                           equ 0001h
PORTJ_RJ6_LENGTH                         equ 0001h
PORTJ_RJ6_MASK                           equ 0040h
PORTJ_RJ7_POSN                           equ 0007h
PORTJ_RJ7_POSITION                       equ 0007h
PORTJ_RJ7_SIZE                           equ 0001h
PORTJ_RJ7_LENGTH                         equ 0001h
PORTJ_RJ7_MASK                           equ 0080h
PORTJ_ALE_POSN                           equ 0000h
PORTJ_ALE_POSITION                       equ 0000h
PORTJ_ALE_SIZE                           equ 0001h
PORTJ_ALE_LENGTH                         equ 0001h
PORTJ_ALE_MASK                           equ 0001h
PORTJ_OE_POSN                            equ 0001h
PORTJ_OE_POSITION                        equ 0001h
PORTJ_OE_SIZE                            equ 0001h
PORTJ_OE_LENGTH                          equ 0001h
PORTJ_OE_MASK                            equ 0002h
PORTJ_WRL_POSN                           equ 0002h
PORTJ_WRL_POSITION                       equ 0002h
PORTJ_WRL_SIZE                           equ 0001h
PORTJ_WRL_LENGTH                         equ 0001h
PORTJ_WRL_MASK                           equ 0004h
PORTJ_WRH_POSN                           equ 0003h
PORTJ_WRH_POSITION                       equ 0003h
PORTJ_WRH_SIZE                           equ 0001h
PORTJ_WRH_LENGTH                         equ 0001h
PORTJ_WRH_MASK                           equ 0008h
PORTJ_BA0_POSN                           equ 0004h
PORTJ_BA0_POSITION                       equ 0004h
PORTJ_BA0_SIZE                           equ 0001h
PORTJ_BA0_LENGTH                         equ 0001h
PORTJ_BA0_MASK                           equ 0010h
PORTJ_CE_POSN                            equ 0005h
PORTJ_CE_POSITION                        equ 0005h
PORTJ_CE_SIZE                            equ 0001h
PORTJ_CE_LENGTH                          equ 0001h
PORTJ_CE_MASK                            equ 0020h
PORTJ_LB_POSN                            equ 0006h
PORTJ_LB_POSITION                        equ 0006h
PORTJ_LB_SIZE                            equ 0001h
PORTJ_LB_LENGTH                          equ 0001h
PORTJ_LB_MASK                            equ 0040h
PORTJ_UB_POSN                            equ 0007h
PORTJ_UB_POSITION                        equ 0007h
PORTJ_UB_SIZE                            equ 0001h
PORTJ_UB_LENGTH                          equ 0001h
PORTJ_UB_MASK                            equ 0080h

